AccumulationRegisters/УслугиДавальцуКОформлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>УслугиДавальцуКОформлению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказДавальца</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/УслугиДавальцуКОформлению/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.УслугиДавальцуКОформлению";
	ИмяРегистра       = "УслугиДавальцуКОформлению";
	
	// Выпуск продукции
	ПолноеИмяДокумента = "Документ.ВыпускПродукции";
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТаблицаТовары.Ссылка.Дата              КАК Период,
		|	ТаблицаТовары.Назначение.Заказ         КАК ЗаказДавальца,
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.Количество               КАК КОформлению,
		|	0 КАК Заказано,
		|	0 КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК ПричинаОтмены
		|ИЗ
		|	Документ.ВыпускПродукции.Товары КАК ТаблицаТовары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|		ПО ТаблицаТовары.Распоряжение.Распоряжение = ЗаказНаПроизводствоПродукция.Ссылка
		|		И ТаблицаТовары.Распоряжение.КодСтроки = ЗаказНаПроизводствоПродукция.КодСтроки
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК ВыходныеИзделияМаршрутногоЛиста
		|		ПО ТаблицаТовары.Распоряжение = ВыходныеИзделияМаршрутногоЛиста.Ссылка
		|		И ТаблицаТовары.КодСтроки = ВыходныеИзделияМаршрутногоЛиста.КодСтроки
		|		И ВыходныеИзделияМаршрутногоЛиста.ПроизводитсяВПроцессе
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.ВозвратныеОтходы КАК ВозвратныеОтходыМаршрутногоЛиста
		|		ПО ТаблицаТовары.Распоряжение = ВозвратныеОтходыМаршрутногоЛиста.Ссылка
		|		И ТаблицаТовары.КодСтроки = ВозвратныеОтходыМаршрутногоЛиста.КодСтроки
		|		И ВозвратныеОтходыМаршрутногоЛиста.ПроизводитсяВПроцессе
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|		ПО СпрНазначения.Ссылка = ТаблицаТовары.Назначение
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И СпрНазначения.Заказ ССЫЛКА Документ.ЗаказДавальца
		|	И ЗаказНаПроизводствоПродукция.КлючСвязиПродукция = &ПустойКлючСвязи
		|	И ВыходныеИзделияМаршрутногоЛиста.Ссылка ЕСТЬ NULL
		|	И ВозвратныеОтходыМаршрутногоЛиста.Ссылка ЕСТЬ NULL";
	
	СинонимТаблицыДокумента = "ТаблицаТовары";
	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров.Вставить("ПустойКлючСвязи", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Результат.ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
		ТекстЗапроса, ПолноеИмяДокумента, СинонимТаблицыДокумента);
	
	Регистраторы = ОбновлениеИнформационнойБазыУТ.РегистраторыДляПерепроведения(
		Результат, ПолноеИмяРегистра, ПолноеИмяДокумента);
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	
	Регистраторы.Добавить("Документ.ВыпускПродукции");
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы, "РегистрНакопления.УслугиДавальцуКОформлению", Параметры.Очередь);
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
